Revit 2026 API

# CommandEventArgs Class

---

The base class of the command Executed and CanExecute event arguments.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitEventArgs Autodesk.Revit.UI.EventsCommandEventArgs Autodesk.Revit.UI.EventsBeforeExecutedEventArgs Autodesk.Revit.UI.EventsCanExecuteEventArgs Autodesk.Revit.UI.EventsExecutedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CommandEventArgs : RevitEventArgs
```
```vb
Public Class CommandEventArgs
	Inherits RevitEventArgs
```
```cpp
public ref class CommandEventArgs : public RevitEventArgs
```
```fsharp
type CommandEventArgs =
    class
        inherit RevitEventArgs
    end
```

The CommandEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveDocument | The active document. |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from RevitEventArgs) |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitEventArgs) |
|  | CommandId | The command id. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace